@FooterPage
Feature: Проверка футтера на страницах сайта

  @FooterMainPageBlock
  Scenario: Проверить футтера сайта на главной странице
    Given Открыть главную страницу сайта
    When Клик по кнопке Окей поп-апа Cookies
    When Пролистать страницу вниз
    When Проверка отображения блока футтера
    When Проверка отображения Кнопки 'Новый проект'
    When Проверка отображения LOGO only.digital
    When Проверка отображения блока кнопок 'Социальных сетей'
    When Проверка отображения кнопки behance.net
    When Проверка отображения кнопки dprofile.ru
    When Проверка отображения кнопки t.me
    When Проверка отображения кнопки vk.com
    When Проверка отображения блока Telegram для связи
    When Проверка отображения блока Почта и номер телефона для связи
    When Проверка отображения блока Текста девиза
    When Проверка отображения блока презентаций компании
    When Проверка отображения кнопки презентации компании PDF
    When Проверка отображения кнопки презентации компании PITCH
    When Проверка отображения Годы работы компании
    When Пролистать страницу вниз
    When Проверка отображения баннера Creative Digital Production
    When Проверка отображения кнопки Политика конфиденциальности

  @FooterBlockProjectsPage
  Scenario: Проверить футтера сайта на странице Проекты
    Given Открыть главную страницу сайта
    When Клик по кнопке Окей поп-апа Cookies
    When Клик по кнопке Проекты в Header меню
    When Пролистать страницу вниз
    When Проверка отображения блока футтера
    When Проверка отображения Кнопки 'Новый проект'
    When Проверка отображения LOGO only.digital
    When Проверка отображения блока кнопок 'Социальных сетей'
    When Проверка отображения кнопки behance.net
    When Проверка отображения кнопки dprofile.ru
    When Проверка отображения кнопки t.me
    When Проверка отображения кнопки vk.com
    When Проверка отображения блока Telegram для связи
    When Проверка отображения блока Почта и номер телефона для связи
    When Проверка отображения блока Текста девиза
    When Проверка отображения блока презентаций компании
    When Проверка отображения кнопки презентации компании PDF
    When Проверка отображения кнопки презентации компании PITCH
    When Проверка отображения Годы работы компании
    When Пролистать страницу вниз
    When Проверка отображения баннера Creative Digital Production
    When Проверка отображения кнопки Политика конфиденциальности

  @FooterBlockCompanyPage
  Scenario: Проверить футтера сайта на странице Компания
    Given Открыть главную страницу сайта
    When Клик по кнопке Окей поп-апа Cookies
    When Клик по кнопке Компания в Header меню
    When Пролистать страницу вниз
    When Проверка отображения блока футтера
    When Проверка отображения Кнопки 'Новый проект'
    When Проверка отображения LOGO only.digital
    When Проверка отображения блока кнопок 'Социальных сетей'
    When Проверка отображения кнопки behance.net
    When Проверка отображения кнопки dprofile.ru
    When Проверка отображения кнопки t.me
    When Проверка отображения кнопки vk.com
    When Проверка отображения блока Telegram для связи
    When Проверка отображения блока Почта и номер телефона для связи
    When Проверка отображения блока Текста девиза
    When Проверка отображения блока презентаций компании
    When Проверка отображения кнопки презентации компании PDF
    When Проверка отображения кнопки презентации компании PITCH
    When Проверка отображения Годы работы компании
    When Пролистать страницу вниз
    When Проверка отображения баннера Creative Digital Production
    When Проверка отображения кнопки Политика конфиденциальности

  @FooterBlockFieldsPage
  Scenario: Проверить футтера сайта на странице Направления
    Given Открыть главную страницу сайта
    When Клик по кнопке Окей поп-апа Cookies
    When Клик по кнопке Направления в Header меню
    When Пролистать страницу вниз
    When Проверка отображения блока футтера
    When Проверка отображения Кнопки 'Новый проект'
    When Проверка отображения LOGO only.digital
    When Проверка отображения блока кнопок 'Социальных сетей'
    When Проверка отображения кнопки behance.net
    When Проверка отображения кнопки dprofile.ru
    When Проверка отображения кнопки t.me
    When Проверка отображения кнопки vk.com
    When Проверка отображения блока Telegram для связи
    When Проверка отображения блока Почта и номер телефона для связи
    When Проверка отображения блока Текста девиза
    When Проверка отображения блока презентаций компании
    When Проверка отображения кнопки презентации компании PDF
    When Проверка отображения кнопки презентации компании PITCH
    When Проверка отображения Годы работы компании
    When Пролистать страницу вниз
    When Проверка отображения баннера Creative Digital Production
    When Проверка отображения кнопки Политика конфиденциальности

  @FooterBlockJobPage
  Scenario: Проверить футтера сайта на странице Карьера
    Given Открыть главную страницу сайта
    When Клик по кнопке Окей поп-апа Cookies
    When Клик по кнопке Карьера в Header меню
    When Пролистать страницу вниз
    When Проверка отображения блока футтера страницы Карьера
    When Проверка отображения блока кнопок 'Социальных сетей' для страниц Карьера и Контакты
    When Проверка отображения кнопки behance.net для страниц Карьера и Контакты
    When Проверка отображения кнопки dprofile.ru для страниц Карьера и Контакты
    When Проверка отображения кнопки t.me для страниц Карьера и Контакты
    When Проверка отображения кнопки vk.com для страниц Карьера и Контакты
    When Проверка отображения Годы работы компании для страниц Карьера и Контакты
    When Проверка отображения баннера Creative Digital Production страницы Карьера
    When Проверка отображения кнопки Политика конфиденциальности для страниц Карьера и Контакты

  @FooterBlockBlogPage
  Scenario: Проверить футтера сайта на странице Блог
    Given Открыть главную страницу сайта
    When Клик по кнопке Окей поп-апа Cookies
    When Клик по кнопке Блог в Header меню
    When Пролистать страницу вниз
    When Проверка отображения блока футтера
    When Проверка отображения Кнопки 'Новый проект'
    When Проверка отображения LOGO only.digital
    When Проверка отображения блока кнопок 'Социальных сетей'
    When Проверка отображения кнопки behance.net
    When Проверка отображения кнопки dprofile.ru
    When Проверка отображения кнопки t.me
    When Проверка отображения кнопки vk.com
    When Проверка отображения блока Telegram для связи
    When Проверка отображения блока Почта и номер телефона для связи
    When Проверка отображения блока Текста девиза
    When Проверка отображения блока презентаций компании
    When Проверка отображения кнопки презентации компании PDF
    When Проверка отображения кнопки презентации компании PITCH
    When Проверка отображения Годы работы компании
    When Пролистать страницу вниз
    When Проверка отображения баннера Creative Digital Production
    When Проверка отображения кнопки Политика конфиденциальности


  @FooterBlockСontactsPage
  Scenario: Проверить футтера сайта на странице Контакты
    Given Открыть главную страницу сайта
    When Клик по кнопке Окей поп-апа Cookies
    When Клик по кнопке Контакты в Header меню
    When Пролистать страницу вниз
    When Проверка отображения блока футтера страницы Контакты
    When Проверка отображения блока кнопок 'Социальных сетей' для страниц Карьера и Контакты
    When Проверка отображения кнопки behance.net для страниц Карьера и Контакты
    When Проверка отображения кнопки dprofile.ru для страниц Карьера и Контакты
    When Проверка отображения кнопки t.me для страниц Карьера и Контакты
    When Проверка отображения кнопки vk.com для страниц Карьера и Контакты
    When Проверка отображения Годы работы компании для страниц Карьера и Контакты
    When Проверка отображения баннера Creative Digital Production страницы Контакты
    When Проверка отображения кнопки Политика конфиденциальности для страниц Карьера и Контакты



