# new feature
# Tags: optional

Feature: Проверка страницы Франчайзинг

  Scenario: Проверка страницы Франчайзинг
    Given Открыть главную страницу сайта
    When Кликнуть Ссылка на Франчайзинг
    When Проверить Блок заголовка
    When Проверить Блок Собственный бизнес с лидером
    When Проверить Блок INVITRO – один из самых известных
    When Проверить Блок 5 шагов к собственному медицинскому офису
    # When Проверить Блок фото и видео
    When Проверить Блок Требования к инвесторам
    When Проверить Блок Выберите удобную схему сотрудничества
    When Проверить Блок Мы уже открыли более 1000 медицинских офисов
