# new feature
# Tags: optional

Feature: Проверка страницы Медицинским организациям

  Scenario: Проверка страницы Медицинским организациям
    Given Открыть главную страницу сайта
    When Кликнуть Корпоративным клиентам в шапке
    When Проверить Заголовок Медицинским организациям
    When Проверить Блок Станьте партнером крупнейшей
    When Проверить Блок ИНВИТРО – надежный партнер
    When Проверить Блок более 2000 лабораторных исследований

    When Проверить Блок Хотите узнать, как все работает
    When Проверить Блок Партнерская программа ИНВИТРО
    When Проверить Блок Преимущества сотрудничества
    When Проверить Блок Наше оборудование
    When Проверить Блок Полный пакет услуг Все включено
    When Проверить Блок Автоматизируем работу с клиентами

    When Проверить Блок Возможность направлять ваших пациентов в сеть медицинских офисов ИНВИТРО
    When Проверить Блок Более 4000 медучреждений в России и странах СНГ сотрудничают с ИНВИТРО
    When Проверить Блок Отзывы
    When Проверить Блок Остались вопросы
    When Проверить Кнопка Перезвонить

